import java.io.*;
import java.util.*;

public class Main {
    public static void main(String[] args) throws Exception {
        BufferedWriter bw = new BufferedWriter(new OutputStreamWriter(System.out));
        StringBuilder sb = new StringBuilder();

        sb.append("""
                안녕하세요.
                백준의 끝을 함께 하게되어 안타깝네요.
                하지만 보내줘야할 건 보내줘야한다고 생각합니다.
                전 1년전인가? 2년전에 사촌형이 백준을 아냐고 물어봤을 때부터시작했습니다.
                전 그날 집에 가서 바로 백준에 회원가입을 했습니다.
                백준은 수많은 사람들에게 직장을 주고, 능력을 주고, 도전할 기회를 주었죠.
                그 결말이 이렇게 되다니 슬프네요.
                겨우 통과했을 때의 그 짜릿함도 전부 여기서 느끼게 되었고,
                틀렸습니다를 수십 번 보면서도 포기하지 않는 법을 배웠고,
                남이 짠 풀이를 보면서 ‘아, 이렇게도 생각할 수 있구나’ 하고 시야가 넓어졌습니다.
                단순히 문제를 푸는 사이트가 아니라, 생각하는 방법을 배우는 곳이었던 것 같아요.
                그래도 여기서 보낸 시간은 사라지지 않겠죠.
                제가 짠 코드들, 고민했던 시간들, 그리고 조금은 성장한 저까지.
                이제 끝난다고하니, 느낌이 이상하네요.
                제 추억이 결론적으로 없는게 되어버린다는게. 다 불태우고 남은 재처럼.
                비가 와 다 젖어버린 세상처럼. 없었던 시간을 찾는것처럼.
                이유를 찾다가 소멸해버린 재처럼.
                
                준비되었다
                이유를찾는일과는
                재가되어버렸다
                가을은비가되었다
                시간은재가되었다.
                재는과일이되었다
                재는불이찾는과일이되었다
                
                이제 정말로 끝이네요...
                고마웠습니다. 백준..
                마지막으로 제가 가장 좋아하는 노래의 구절을 남기고 가죠.
                '마지막에는 웃음이 좋은 걸 알지만 조금만 울어도 괜찮을까요?'
                저는 잊지 않도록하겠습니다.
                그동안 스타트링크분들도 수고하셨습니다.
                백준과 함께해주신분들 감사합니다.
                이제 이 열심히 달려온 16년간의 이야기의 종지부이자 결말을 맺을 시간이 되었네요.
                이상 LacyCat 올림
                """);
        bw.append(sb);
        bw.flush();
        bw.close();
    }
}